{
    "DESKTOP": {
        "MAQUIAR": "MaquiAR",
        "RESUME": "Resume.pdf",
        "URLSHORTENER": "URL Shortener",
        "PORTFOLIO": "This Website",
        "HSSETREVIEWBOT": "Hearthstone Set Review Bot",
        "HSSETREVIEWSITE": "Hearthstone Set Review Hub",
        "RECYCLEBIN": "Recycle Bin"
    },
    "STARTBAR": {
        "START": "Start",
        "USER": "User",
        "CONTACT": "Contact",
        "PROGRAMS": "Other Programs",
        "ABOUT": "About",
        "LANGUAGES": "Change Language"
    },
    "ABOUT": {
        "TITLE": "About",
        "GREETING": {
            "HEADLINE": "Hi,",
            "TEXT": "my name is Mateus Cechetto and welcome to my portfolio :)"
        },
        "TEXT": "<p> I'm a software engineer from Florianópolis, Brazil. I'm passionate about simple and impactful solutions. More than anything, I like to see technology as a tool to improve people's lives.</p><p>I graduated in Information Systems from the Universidade Federal de Santa Catarina (UFSC). I have experience with <b>Python, Java, Groovy, TypeScript, Angular, HTML/CSS, Android,</b> and <b>Kotlin</b>.</p><p>I worked during 2 years in a lab at UFSC, in projects for the Brazilian Department of Education (MEC).  There, I collaborated within a multidisciplinary team, which allowed me to view the world from different perspectives. This experience shifted my perception of technology as a means to an end, rather than an end in itself. </p><p>I created this website to showcase some of my projects, as well as to evoke memories from my upbringing using Windows XP :)</p>",
        "TIPS": {
            "TEXT": "Tips:",
            "1": "You can move this window and resize it",
            "2": "You can change the language on the start menu.",
            "4": "You can close the start menu by clicking outside of it",
            "5": "You can change the active window in the taskbar",
            "6": "You can enter fullscreen mode by pressing F11 or clicking here"
        }
    },
    "MAQUIAR": {
        "TITLE": "MaquiAR",
        "HEADLINE": "MaquiAR: An augmented reality makeup try-on app using ARCore",
        "TEXT": "<p>I developed the MaquiAR app as part of my undergraduate thesis for the Bachelor of Information Systems program at Universidade Federal de Santa Catarina (UFSC). The app allows users to try on makeup virtually before making online purchases. </p>",
        "READMORE": "<hr><p>The <b>Android</b> app was written mostly in <b>Kotlin</b> with some parts in <b>Java</b>. It uses <b>ARCore</b> to utilize <b>Augmented Reality</b>.</p><p>Features:</p><ul><li>List the makeups</li><li>Makeup description page</li><li>Makeup try on</li><li>Change the makeup without leaving try on screen</li><li>Add, remove and visualize favorite makeups</li><li>Take photos and share in social media</li><li>Redirect the user to the website he can buy the makeup</li></ul><p>In order to reutilize the textures for different makeup colors, I created a white texture and used <b>Open GL Shading Language (GLSL)</b> to give it different colors. Since white has value (1,1,1) it is multiplication neutral element, so I can just multiply the white texture with the color of the makeup.</p><p>The <b>System Usability Scale (SUS)</b> questionnaire was applied to 10 students and MaquiAR's average score was <b>88.5.</b></p>",
        "THESIS": "Thesis"
    },
    "PORTFOLIO": {
        "TITLE": "Portfolio",
        "HEADLINE": "Windows XP: Mateus Cechetto Edition",
        "TEXT": "<p>I developed this website as my portfolio to showcase some of my projects. </p><p>The website simulates a Windows XP desktop environment and was built using <b>Angular, TypeScript, HTML,</b> and <b>SCSS</b>.</p>",
        "READMORE": "<hr><ul><li>The projects are presented in windows</li><li>The windows can be moved and resized</li><li>Once a window is clicked, it gets focused</li><li>The user can change the focused window using the start bar</li><li>It has 2 languages: English and Portuguse</li><li>It recognizes the user's browser language and sets to one of the two; the default is English</li><li>The language can be changed in real time, without reloading the page</li><li>It is mobile-friendly</li><li>The clock updates in real time</li><li>It has other programs such as Paint and Minesweeper</li></ul>"
    },
    "HSSETREVIEWBOT": {
        "TITLE": "Set Review Bot",
        "HEADLINE": "Twitch chat bot to help Hearthstone set reviews",
        "TEXT": "<p>Hearthstone is a popular turn-based digital collectible card game boasting millions of active players. Each year, the game releases between 3 and 4 new sets, introducing fresh cards and strategies. In anticipation of these expansions, prominent players and streamers provide set reviews, offering their insights on the new cards.</p><p>To enhance viewer engagement, I developed a bot that integrates the audience into the review process. The bot allows viewers to share their personal ratings for the cards directly through Twitch chat. These ratings are then collected and stored in a Google Sheets document for reference.</p><p>For the technical implementation, I utilized <b>Node, Express, OAuth2, JWT, MongoDB (Mongoose), tmi.js, </b> and <b>Google Sheets API</b>.  In addition, I created a simple frontend using <b>React</b>, which I deployed on <b>Heroku</b></p>",
        "READMORE": "<hr><ul><li>1140 different people rated cards</li><li>Total of 18221 ratings were given for the 135 cards</li><li>32777 twitch chat messages were read</li></ul>"
    },
    "HSSETREVIEWSITE": {
        "TITLE": "Set Review Hub",
        "HEADLINE": "Hearthstone Set Review Hub",
        "TEXT": "<p>After being praised for the Set Review Bot, I decided to evolve it into a plataform to centralize information about card reviews and let any user create their own, while still providing the bot for streamers record their chat's ratings for each card.</p><p>Keeping the same backend from the Set Review Bot, I decided to change the frontend to <b>Angular</b> with <b>PrimeNG</b> components, techs that I am more familiar with, being able to deploy it in time for the \"Showdown in the Badlands\" expansion, released in November 2023. <b>In a week, more than 80 users</b> created an account in the system.</p><p>After deployment, people reach me out willing to contribute to the project, which made me adapt the project to follow community standards for open-source. One of those developers was a member of Untapped.gg (company that created the most popular Deck Tracker tool for Hearthstone), and provided data about the cards after the expansion release.</p><p>With that data, I and a friend of mine trained classification models, using <b>Python</b> libraries <b>Pandas</b> and <b>scikit-learn</b>, to give ratings to the cards based on their popularity and winrate. The model achieved a satisfying accuracy (around 74%) and we used those ratings to compare to the users before expansion ratings and to rank the best reviews.</p>",
        "READMORE": "<hr><p>For the second expansion after the website is live, it reached even better results:</p><ul><li><b>230 users</b> logged in and rated at least 1 cards</li><li><b>Over 700 users</b> rated cards <b>concurrently</b> via Twitch chat interactions.</li><li>The platform also gained visibility among prominent streamers, including the current world champion</li></ul>"
    },
    "URLSHORTENER": {
        "TITLE": "URL Shortener",
        "HEADLINE": "A URL shortener, like tinyURL",
        "TEXT": "<p> I developed this application as part of a coding test for a company, and I'm pleased to mention that I was ultimately hired by them. The application's purpose is to generate shortened URLs for any given URL input. Additionally, it retains a history of the last URLs that users have shortened. </p> <p> The project was designed to meet specific system requirements provided in the coding test: </p> <ul><li>The website should allow users to input an original URL and generate a unique code with five or fewer characters</li><li>The generated short URL must remain valid indefinitely, and even if the same original URL is entered multiple times, the resulting short URL must be different each time</li><li>Upon accessing the short URL, users should be instantly redirected to the original URL, ensuring minimal delay</li></ul>",
        "READMORE": "<hr><p>The back-end application was developed using <b>Java</b> with <b>Spring Boot</b>. <b>JPA (Java Persistence API)</b> and <b>PostgreSQL</b> were employed for database management.</p><p>This application comprises two main endpoints: a <b>POST</b> endpoint for generating short URLs based on input URLs, and a <b>GET</b> endpoint for redirecting users to the original websites using short URLs. If the provided short URL is valid, the user is redirected; otherwise, they are directed to the front-end error page.</p><p>To fulfill the requirements, the following strategies were adopted:</p><ul><li>Upon receiving a URL, a unique sequential ID is generated. This ID increments sequentially, ensuring uniqueness even in concurrent scenarios.</li><li>The unique ID is then encoded to base62, resulting in a short URL composed of numbers, lowercase, and uppercase letters.</li><li>For retrieving the original URL from the short URL, the encoded short URL is decoded to obtain the corresponding ID in the database.</li></ul><p>Despite making short URLs predictable (which could pose a security risk), sequential IDs were chosen (using JPA's GeneratedValue) to ensure uniqueness even in scenarios involving <b>concurrency</b>.</p><hr><p>The front-end application was developed using <b>Angular</b> and utilizes <b>Angular Material</b> components for its user interface.</p><p>The interface design is <b>clean</b> and <b>simple</b>, offering an intuitive user experience.</p><p>To maintain a <b>history</b> of shortened URLs, user data is stored in the browser's <b>local storage</b>.</p>"
    },
    "RECYCLEBIN": {
        "TITLE": "Recycle Bin",
        "MOREABOUTME": "More about me"
    },
    "MOREABOUTME": {
        "HEADLINE": "A bit about my hobbies",
        "TEXT": "<p>My hobbies encompass a range of interests, including sports (particularly football ⚽), video games 🎮, music 🎵, and country trivia 🌍. I've learned so many facts about countries that made me want to visit all them, and I will!</p><p>During my youth, I played football in Brazilian first-division youth teams, an experience that made me very <b>disciplined</b> and <b>hard worker</b>.</p><p>Amid the onset of the COVID-19 pandemic in 2020, I ventured into competitive Hearthstone. Hearthstone is a turn-based digital collectible card game  between two opponents, using constructed decks of 30 cards along with a selected hero with a unique power. In that year:</p><ul><li>I consistently secured top positions on the ranked ladder (I'm the third Brazilian with the most ladder finishes)</li><li>I achieved top 10 and top 8 finishes in the last two ESL Brazilian Premier Leagues.</li><li>I participated in 2 Masters Tours, which are the top-tier Hearthstone tournaments</li><li>I peaked at rank 2 of Asia-Pacific server and rank 7 of Americas'</li><li>I created one of the best decks ever (6D Warlock)</li><li>I crafted several other successful decks</li></ul><p>During this period, I collaborated with world-renowned players within practice groups. In these groups, I played a pivotal role as the <b>imaginative</b> and <b>innovative</b> member, constantly devising new strategies. My proficiency in <b>English</b> significantly improved as I engaged in multiple chats and frequent voice calls. I even streamed in English to a public of over 900 people.</p><p>In 2021, I immersed myself in Sporcle trivia challenges, mastering the flags of every country worldwide. Notably, I can accurately pinpoint each country on a map, even without borderlines!</p>",
        "ENGLISH": "English",
        "CREATIVITY": "Creativity",
        "TEAMWORK": "Teamwork",
        "DISCIPLINE": "Discipline",
        "TIMEMANAGEMENT": "Time Management"
    },
    "MSPAINT": {
        "TITLE": "Paint",
        "SIZE": "Size",
        "CLEAR": "Clear",
        "OPENNEWTAB": "Open image",
        "DOWNLOAD": "Download"
    },
    "MINESWEEPER": {
        "TITLE": "Minesweeper",
        "EASY": "Easy",
        "NORMAL": "Normal",
        "HARD": "Hard",
        "TOOLTIPHARD": "Hard mode is not enabled yet"
    },
    "RESUMELINK": "../../assets/pdfs/Mateus Cechetto Resume.pdf",
    "READMORE": "read more",
    "READLESS": "read less"
}